b_prediction_old/RANS_cases/3_pc_Re_tau_550/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
		solver			GAMG;
		tolerance		1e-5;
		relTol			0.01;
		smoother		GaussSeidel;
		nPreSweeps		0;
		nPostSweeps		2;
		cacheAgglomeration	on;
		agglomerator		faceAreaPair;
		nCellsInCoarsestLevel	100;
		mergeLevels		1;
	}
   

    "(U|k|epsilon|omega)"
    {
        solver          smoothSolver;
        preconditioner  DILU;
        smoother        DILUGaussSeidel;
        nSweeps         1;
        tolerance       0;
        relTol          1e-5;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      yes;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p               1e-5;
        U               1e-5;
        "(k|epsilon|omega|f|v2)" 1e-5;
    }
}

relaxationFactors
{
    equations
    {
        U               0.7;
        p				0.3;
        k				0.7;
        omega			0.7;
    }
}


// ************************************************************************* //
